# IsReference Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElevationMarker..::..IsReference Property
ElevationMarker Class See Also
---
Indicates if this is a reference ElevationMarker. Only reference elevations can be hosted by reference ElevationMarkers.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsReference { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsReference As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsReference {
	bool get ();
}
```

# See Also
ElevationMarker Class
Autodesk.Revit.DB Namespace